Projects/Bank v6/Data/match-kioskv6-addUser.txt

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"><soapenv:Body><addUserObject xmlns="http://ejb3.examples.itko.com/"><userObject xmlns=""><accounts><balance>100000</balance><name>primary</name><type>CHECKING</type></accounts><accounts><balance>555555</balance><name>fun money</name><type>SAVINGS</type></accounts><addresses><city>Plano</city><line1>5800 Granite Pkwy</line1><line2>Suite 550</line2><state>TX</state><zip>75024</zip></addresses><email>Demo@itko.com</email><fname>DemoFirst</fname><lname>DemoLast</lname><login>DemoFirst</login><newFlag>true</newFlag><phone>2145551212</phone><pwd>pass</pwd><roleKey>REGULAR</roleKey><ssn>333224444</ssn></userObject></addUserObject></soapenv:Body></soapenv:Envelope>